#++++++++++++++++++++++++++++++++++++++++++++++++
# 题目
#   （金融应用程序：复利值）加上你每月存 100 块到一个年利率为 5% 的
#   存储账户。因此，月利率是 0.05/12=0.00417。第一个月后，账户存款为
#       100 * (1 + 0.00417) = 100.417
#   第二个月后，账户存款变为
#       (100 + 100.417) * (1 + 0.00417) = 201.252
#   第三个月后，账户存款额为
#       (100 + 201.252) * (1 + 0.00417) = 302.507
#   以此类推。
#   编写一个程序，提升用户每月存款数然后显示六个月后的账户总额。
#++++++++++++++++++++++++++++++++++++++++++++++++

monthly_sav = eval(input("Ener the monthly saving amount: "))

rate = 0.05 / 12
ratio = 1 + rate
amount = 0

for i in range(6):
    amount += monthly_sav
    amount *= ratio

print("After the sixth month, the account value is %f." % (amount))
